## Production: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |             NAME              |
|--------|-------------------------------|
| add    | `aws_route53_zone.ai_answers` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.ai_answers will be created
  + resource "aws_route53_zone" "ai_answers" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ai-answers.alpha.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "ai-answers-prod"
          + "Name"       = "ai-answers-zone"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "ai-answers-prod"
          + "Name"       = "ai-answers-zone"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hosted_zone_id   = (known after apply)
  + hosted_zone_name = "ai-answers.alpha.canada.ca"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
